Revit 2024 API
FamilyManager Class
The family manager object to manage the family types and parameters in family document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public class FamilyManager : APIObject
Visual Basic
Public Class FamilyManager _
	Inherits APIObject
Visual C++
public ref class FamilyManager : public APIObject
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.FamilyManager
See Also
FamilyManager Members
Autodesk.Revit.DB Namespace